Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/industrial_relations_and_trade_unions/employment_regulation_orders_and_registered_employment_agreements.html.txt.tmx
Source language: en
Languages: ga

source: Employment Regulation Orders and registered employment agreements
ga: Orduithe Rialaithe Fostaíochta agus comhaontuithe fostaíochta cláraithe

source: • REAs and sectoral employment orders
ga: • CFC agus orduithe earnála fostaíochta

source: • Pre-2011 EROs and pre-2013 REAs
ga: • ORF roimh 2011 agus CFC roimh 2013

source: In addition to arrangements such as the national minimum wage, some employees are covered by particular agreements that deal with the pay and working conditions of the employees concerned and may be included in an employee’s contract of employment
ga: Chomh maith le socruithe ar nós an íosphá náisiúnta, tá fostaithe áirithe clúdaithe ag comhaontuithe a bhaineann le coinníollacha oibre agus pá na bhfostaithe agus b’fhéidir go mbíonn siad luaite i gconradh fostaíochta an fhostaí

source: • The various agreements on pay and conditions made by Joint Labour Committees (JLCs) are known as Employment Regulation Orders (EROs)
ga: • Tugtar na hOrduithe Rialaithe Fostaíochta ar na comhaontaithe uile atá déanta ar chúrsaí pá agus coinníollacha ag na Comhchoistí Oibreachais

source: • Agreements which result from negotiations between trade unions and employers are called collective agreements
ga: • Tugtar comhaontuithe comhchoiteann ar na comhaontuithe a eascraíonn as idirbheartaíochtaí idir ceardchumainn agus fostóirí

source: • If a collective agreement relating to the pay or conditions of specified workers has been registered with the Labour Court, it is known as a registered employment agreement (REA)
ga: • Má tá comhaontú comhchoiteann cláraithe leis an gCúirt Oibreachais, glaoitear an comhaontú fostaíochta cláraithe (CFC) air

source: • The Labour Court may recommend that a sectoral employment order (SEO) be made for an economic sector on matters of pay, pension or sick pay scheme
ga: • Is féidir an Chúirt Oibreachais moladh go ndéantar ordú fostaíochta earnála (OFE) a bhaineann le hearnáil eacnamaíoch le haghaidh phá, scéimeanna pinsin nó phá breoiteachta

source: Following a High Court decision, all Employment Regulation Orders ceased to have statutory effect from 7 July 2011
ga: Ag leanúint ó chinneadh na hArd-Chúirte, stad Orduithe Rialaithe Fostaíochta d’aon tionchar reachtúla ón 7 Iúil 2011

source: The Industrial Relations (Amendment) Act 2012 which reformed the Joint Labour Committees' wage-setting mechanisms came into force on 1 August 2012
ga: An 1 Lúnasa 2012, tháinig an tAcht Caidrimh Thionscail (Leasú) 2012 (pdf) a d'athchóirigh na meicníochtaí cinneadh pá faoin gComhchoiste Oibreachais i bhfeidhm

source: Under the Act, the Labour Court adopts an Employment Regulation Order (ERO) drawn up by a Joint Labour Committee
ga: Faoin Acht, uchtaíonn an Chúirt Oibreachais Ordú Rialaithe Fostaíochta (ORF) dréachtaithe ag Comhchoiste Oibreachais

source: The ERO is given statutory effect by the Minister for Jobs, Enterprise and Innovation
ga: Tugann an tAire Post, Fiontar agus Nuálaíochta éifeacht reachtúil don ORF

source: There are new EROs for the contract cleaning and security industries – see below
ga: Tá ORF nua le haghaidh tionscail glanadh ar chonradh agus slándála i bhfeidhm – féach thíos

source: The list of Joint Labour Committees is as follows:
ga: Tá liosta Comhchoiste Oibreachais seo leanas:

source: • Catering (Dublin and Dún Laoghaire)
ga: • Lónadóireacht (Baile Átha Cliath agus Dún Laoghaire)

source: • Hotels (Other excluding Cork)
ga: • Óstáin (Eile, ach ní Corcaigh)

source: • Retail, grocery, and allied trades
ga: • Miondíoltóireacht, Grósaeireacht & Comhcheardaithe

source: REAs and sectoral employment orders
ga: CFC agus orduithe earnála fostaíochta

source: Following a decision of the Supreme Court, all registered employment agreements ceased to have statutory effect from 9 May 2013
ga: Ag leanúint ó chinneadh na Cúirte Uachtaraí stad Comhaontuithe Fostaíochta Cláraithe d’aon tionchar reachtúla ón 9 Bealtaine 2013

source: The Industrial Relations (Amendment) Act 2015 provides for a system of registered employment agreements and sectoral employment orders
ga: Soláthraíonn an tAcht Caidrimh Thionscail (Leasú) 2015 córas comhaontuithe fostaíochta cláraithe agus orduithe fostaíochta earnála

source: Registered employment agreements (REAs) are collective agreements that relate to the pay or conditions of employment of specified workers and that are registered with the Labour Court
ga: Is comhaontuithe fostaíochta cláraithe iad comhaontuithe comhchoiteann a bhaineann le pá nó le coinníollacha fostaíochta oibrithe sonraithe atá cláraithe leis an Chúirt Oibreachais

source: Following a request from a trade union or employers’ organisation, the Labour Court may make a recommendation to the Minister for Jobs, Enterprise and Innovation to make a sectoral employment order (SEO)
ga: Ag leanúint ó iarratas ceardchumainn nó eagraíochta fostóirí, is féidir an Chúirt Oibreachais moladh a dhéanamh go ndéanfaidh an tAire Post, Fiontar agus Nuálaíochta ordú fostaíochta earnála (OFE)

source: Under the 2015 Act, an SEO may set out minimum pay rates as well as pension and sick pay schemes for an economic sector
ga: Faoin Acht 2015, leagann OFE síos íosrátaí phá chomh maith le scéimeanna pinsin agus phá breoiteachta a bhaineann le hearnáil eacnamaíoch

source: Section 13 of the Act defines an economic sector as a “sector of the economy concerned with a specific economic activity requiring specific qualifications, skills or knowledge”
ga: Tugann Alt 13 den Acht sainmhíniú ar earnáil eacnamaíoch mar “earnáil an gheilleagair a bhaineann le gníomhaíocht gheilleagrach shainiúil a éilíonn cáilíochtaí, scileanna nó eolas sonracha”

source: Pre-2011 EROs and pre-2013 REAs
ga: ORF roimh 2011 agus CFC roimh 2013

source: Employees who were previously covered by an ERO or an REA have existing contracts of employment which govern their pay and conditions of work
ga: Tá conarthaí fostaíochta reatha ag fostaithe a bhí clúdaithe ag ORF a rialaíonn a bpá agus a gcoinníollacha oibre

source: If an employer reduces an employee’s rate of pay this would be a change in their contract of employment and normally such changes require the employee’s consent
ga: Má laghdaíonn fostóir ráta pá an fhostaí is athrú ar a gconradh fostaíochta a bheadh anseo agus de ghnáth teastaíonn cead an fhostaí chun é seo a dhéanamh
